enggsajjad/myESP32Examples/esp32-stationary/src/lib/AutoConnect/src/AutoConnectPage.cpp
/**
 *  AutoConnect portal site web page implementation.
 *  @file   AutoConnectPage.h
 *  @author hieromon@gmail.com
 *  @version    0.9.7
 *  @date   2019-01-23
 *  @copyright  MIT license.
 */

#if defined(ARDUINO_ARCH_ESP8266)
#include <ESP8266WiFi.h>
extern "C" {
#include <user_interface.h>
}
#elif defined(ARDUINO_ARCH_ESP32)
#include <esp_spi_flash.h>
#include <WiFi.h>
#define ENC_TYPE_NONE WIFI_AUTH_OPEN
#endif
#include "AutoConnect.h"
#include "AutoConnectPage.h"
#include "AutoConnectCredential.h"

/**< Basic CSS common to all pages */
const char AutoConnect::_CSS_BASE[] PROGMEM = {
  "html{"
    "font-family:Helvetica,Arial,sans-serif;"
    "font-size:16px;"
    "-ms-text-size-adjust:100%;"
    "-webkit-text-size-adjust:100%;"
    "-moz-osx-font-smoothing:grayscale;"
    "-webkit-font-smoothing:antialiased;"
  "}"
  "body{"
    "margin:0;"
    "padding:0;"
  "}"
  ".base-panel{"
    "margin:0 22px 0 22px;"
  "}"
  ".base-panel>*>label{"
    "display:inline-block;"
    "width:3.0em;"
    "text-align:right;"
  "}"
  ".base-panel>*>label.slist{"
    "width:auto;"
    "font-size:0.9em;"
    "margin-left:10px;"
    "text-align:left;"
  "}"
  "input{"
    "-moz-appearance:none;"
    "-webkit-appearance:none;"
    "font-size:0.9em;"
    "margin:8px 0 auto;"
  "}"
  ".lap{"
    "visibility:collapse;"
  "}"
  ".lap:target{"
    "visibility:visible;"
  "}"
  ".lap:target .overlap{"
    "opacity:0.7;"
    "transition:0.3s;"
  "}"
  ".lap:target .modal_button{"
    "opacity:1;"
    "transition:0.3s;"
  "}"
  ".overlap{"
    "top:0;"
    "left:0;"
    "width:100%;"
    "height:100%;"
    "position:fixed;"
    "opacity:0;"
    "background:#000;"
    "z-index:1000;"
  "}"
  ".modal_button{"
    "border-radius:13px;"
    "background:#660033;"
    "color:#ffffcc;"
    "padding:20px 30px;"
    "text-align:center;"
    "text-decoration:none;"
    "letter-spacing:1px;"
    "font-weight:bold;"
    "display:inline-block;"
    "top:40%;"
    "left:40%;"
    "width:20%;"
    "position:fixed;"
    "opacity:0;"
    "z-index:1001;"
  "}"
};

/**< non-marked list for UL */
const char AutoConnect::_CSS_UL[] PROGMEM = {
  "ul.noorder{"
    "padding:0;"
    "list-style:none;"
  "}"
  "ul.noorder>*>label{"
    "display:inline-block;"
    "width:86px;"
    "margin-right:10px;"
    "text-align:right;"
  "}"
  "ul.noorder>input[type=\"checkbox\"]{"
    "-moz-appearance:checkbox;"
    "-webkit-appearance:checkbox;"
  "}"
  "ul.noorder>input[type=\"radio\"]{"
    "margin-right:0.5em;"
    "-moz-appearance:radio;"
    "-webkit-appearance:radio;"
  "}"
  "ul.noorder>input[type=\"text\"]:invalid{"
    "background:#fce4d6;"
  "}"
};

/**< Image icon for inline expansion, the lock mark. */
const char AutoConnect::_CSS_ICON_LOCK[] PROGMEM = {
  ".img-lock{"
    "display:inline-block;"
    "width:22px;"
    "height:22px;"
    "margin-top:14px;"
    "float:right;"
    "background: url(data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABgAAAAYCAYAAADgdz34AAAACXBIWXMAAAsTAAALEwEAmpwYAAAB1ElEQVRIibWVu0scURTGf3d2drBQFAWbbRQVCwuVLIZdi2gnWIiF/4GtKyuJGAJh8mgTcU0T8T8ICC6kiIVu44gvtFEQQWwsbExQJGHXmZtiZsOyzCN3Vz+4cDjfvec7j7l3QAF95onRZ54YKmdE1IbnS0c9mnAyAjkBxDy3LRHrjtRyu7OD52HntTAyvbw/HxP2hkCearrRb2WSCSuTTGi60S+QpzFhbwznDl/VVMHw0sF7hEjFbW2qkB38lfp8nNDipWcATil+uDM3cDWyeNRSijnfkHJnezb5Vkkgvbg3IOXD2e1ts93S+icnkZOAVaalZK3YQMa4L+pC6L1WduhYSeCf0PLBdxzOjZ93Lwvm6APAiLmlF1ubPiHotmaS41ExQjH0ZbfNM1NAFpgD0lVcICIrANqAVaAd+AFIYAy4BqaBG+Wsq5AH3vgk8xpYrzf4KLAZwhe8PYEIvQe4vc6H8Hnc2dQs0AFchvAXQGdEDF8s4A5TZS34BQqqQNaS1WMI3KD4WUbNoBJfce9CO7BSr4BfBe8A21vmUwh0VdjdTyHwscL+UK+AHxoD7FDoAX6/Cnpxn4ay/egCjcCL/w1chkqLakLQ/6ABhT57uAd+Vzv/Ara3iY6fK4WxAAAAAElFTkSuQmCC) no-repeat;"
  "}"
};

/**< INPUT button and submit style */
const char AutoConnect::_CSS_INPUT_BUTTON[] PROGMEM = {
  "input[type=\"button\"],input[type=\"submit\"]{"
    "padding:8px 30px;"
    "font-weight:bold;"
    "letter-spacing:0.8px;"
    "color:#fff;"
    "border:1px solid;"
    "border-radius:2px;"
    "margin-top:12px;"
  "}"
  "input[type=\"button\"]{"
    "background-color:#1b5e20;"
    "border-color:#1b5e20;"
    "width:15em;"
  "}"
  ".aux-page input[type=\"button\"]{"
    "font-weight:normal;"
    "padding:8px 14px;"
    "margin:12px;"
    "width:auto;"
  "}"
  "input#sb[type=\"submit\"]{"
    "width:15em;"
  "}"
  "input[type=\"submit\"]{"
    "background-color:#006064;"
    "border-color:#006064;"
  "}"
  "input[type=\"button\"],input[type=\"submit\"]:focus,"
  "input[type=\"button\"],input[type=\"submit\"]:active{"
    "outline:none;"
    "text-decoration:none;"
  "}"
};

/**< INPUT text style */
const char AutoConnect::_CSS_INPUT_TEXT[] PROGMEM = {
  "input[type=\"text\"],input[type=\"password\"], .aux-page select{"
    "background-color:#fff;"
    "border:1px solid #ccc;"
    "border-radius:2px;"
    "color:#444;"
    "margin:8px 0 8px 0;"
    "padding:10px;"
  "}"
  "input[type=\"text\"],input[type=\"password\"]{"
    "font-weight:300;"
    "width:calc(100% - 124px);"
    "-webkit-transition:all 0.20s ease-in;"
    "-moz-transition:all 0.20s ease-in;"
    "-o-transition:all 0.20s ease-in;"
    "-ms-transition:all 0.20s ease-in;"
    "transition:all 0.20s ease-in;"
  "}"
  "input[type=\"text\"]:focus,input[type=\"password\"]:focus{"
    "outline:none;"
    "border-color:#5C9DED;"
    "box-shadow:0 0 3px #4B8CDC;"
  "}"
  "input.error, input.error:focus{"
    "border-color:#ED5564;"
    "color:#D9434E;"
    "box-shadow:0 0 3px #D9434E;"
  "}"
  "input:disabled{"
    "opacity:0.6;"
    "background-color:#f7f7f7;"
  "}"
  "input:disabled:hover{"
    "cursor:not-allowed;"
  "}"
    "input.error::-webkit-input-placeholder{"
    "color:#D9434E;"
  "}"
  "input.error:-moz-placeholder{"
    "color:#D9434E;"
  "}"
  "input.error::-moz-placeholder{"
    "color:#D9434E;"
  "}"
  "input.error:-ms-input-placeholder{"
    "color:#D9434E;"
  "}"
  ".aux-page label{"
    "padding:10px 0.5em;"
  "}"
};

/**< TABLE style */
const char AutoConnect::_CSS_TABLE[] PROGMEM = {
  "table{"
    "border-collapse:collapse;"
    "border-spacing:0;"
    "border:1px solid #ddd;"
    "color:#444;"
    "background-color:#fff;"
    "margin-bottom:20px;"
  "}"
  "table.info,"
  "table.info>tfoot,"
  "table.info>thead{"
    "width:100%;"
    "border-color:#5C9DED;"
  "}"
  "table.info>thead{"
    "background-color:#5C9DED;"
  "}"
  "table.info>thead>tr>th{"
    "color:#fff;"
  "}"
  "td,"
  "th{"
    "padding:10px 22px;"
  "}"
  "thead{"
    "background-color:#f3f3f3;"
    "border-bottom:1px solid #ddd;"
  "}"
  "thead>tr>th{"
    "font-weight:400;"
    "text-align:left;"
  "}"
  "tfoot{"
    "border-top:1px solid #ddd;"
  "}"
  "tbody,"
  "tbody>tr:nth-child(odd){"
    "background-color:#fff;"
  "}"
  "tbody>tr>td,"
  "tfoot>tr>td{"
    "font-weight:300;"
    "font-size:.88em;"
  "}"
  "tbody>tr:nth-child(even){"
    "background-color:#f7f7f7;"
  "}"
    "table.info tbody>tr:nth-child(even){"
    "background-color:#EFF5FD;"
  "}"
};

/**< SVG animation for spinner */
const char AutoConnect::_CSS_SPINNER[] PROGMEM = {
  ".spinner{"
    "width:40px;"
    "height:40px;"
    "position:relative;"
    "margin:100px auto;"
  "}"
  ".double-bounce1, .double-bounce2{"
    "width:100%;"
    "height:100%;"
    "border-radius:50%;"
    "background-color:#a3cccc;"
    "opacity:0.6;"
    "position:absolute;"
    "top:0;"
    "left:0;"
    "-webkit-animation:sk-bounce 2.0s infinite ease-in-out;"
    "animation:sk-bounce 2.0s infinite ease-in-out;"
  "}"
  ".double-bounce2{"
    "-webkit-animation-delay:-1.0s;"
    "animation-delay:-1.0s;"
  "}"
  "@-webkit-keyframes sk-bounce{"
    "0%, 100%{-webkit-transform:scale(0.0)}"
    "50%{-webkit-transform:scale(1.0)}"
  "}"
  "@keyframes sk-bounce{"
    "0%,100%{"
      "transform:scale(0.0);"
      "-webkit-transform:scale(0.0);"
    "}50%{"
      "transform:scale(1.0);"
      "-webkit-transform:scale(1.0);"
    "}"
  "}"
};

/**< Common menu bar. This style quotes LuxBar. */
/**< balzss/luxbar is licensed under the MIT License https://github.com/balzss/luxbar */
const char AutoConnect::_CSS_LUXBAR[] PROGMEM = {
  ".luxbar-fixed{"
    "width:100%;"
    "position:fixed;"
    "top:0;"
    "left:0;"
    "z-index:1000;"
    "box-shadow:0 1px 3px rgba(0, 0, 0, 0.12), 0 1px 2px rgba(0, 0, 0, 0.24);"
  "}"
  ".luxbar-hamburger span,"
  ".luxbar-hamburger span::before,"
  ".luxbar-hamburger span::after{"
    "display:block;"
    "height:2px;"
    "width:26px;"
    "transition:0.6s ease;"
  "}"
  ".luxbar-checkbox:checked~.luxbar-menu li .luxbar-hamburger span{"
    "background-color:transparent;"
  "}"
  ".luxbar-checkbox:checked~.luxbar-menu li .luxbar-hamburger span::before,"
  ".luxbar-checkbox:checked~.luxbar-menu li .luxbar-hamburger span::after{"
    "margin-top:0;"
  "}"
  ".luxbar-header{"
    "display:flex;"
    "flex-direction:row;"
    "justify-content:space-between;"
    "align-items:center;"
    "height:58px;"
  "}"
  ".luxbar-menu-right .luxbar-hamburger{"
    "margin-left:auto;"
  "}"
  ".luxbar-brand{"
    "font-size:1.6em;"
    "padding:18px 24px 18px 24px;"
  "}"
  ".luxbar-menu{"
    "min-height:58px;"
    "transition:0.6s ease;"
    "width:100%;"
  "}"
  ".luxbar-navigation{"
    "display:flex;"
    "flex-direction:column;"
    "list-style:none;"
    "padding-left:0;"
    "margin:0;"
  "}"
  ".luxbar-menu a,"
  ".luxbar-item a{"
    "text-decoration:none;"
    "color:inherit;"
    "cursor:pointer;"
  "}"
  ".luxbar-item{"
    "height:58px;"
  "}"
  ".luxbar-item a{"
    "padding:18px 24px 18px 24px;"
    "display:block;"
  "}"
  ".luxbar-hamburger{"
    "padding:18px 24px 18px 24px;"
    "position:relative;"
    "cursor:pointer;"
  "}"
  ".luxbar-hamburger span::before,"
  ".luxbar-hamburger span::after{"
    "content:'';"
    "position:absolute;"
  "}"
  ".luxbar-hamburger span::before{"
    "margin-top:-8px;"
  "}"
  ".luxbar-hamburger span::after{"
    "margin-top:8px;"
  "}"
  ".luxbar-checkbox{"
    "display:none;"
  "}"
  ".luxbar-checkbox:not(:checked)~.luxbar-menu{"
    "overflow:hidden;"
    "height:58px;"
  "}"
  ".luxbar-checkbox:checked~.luxbar-menu{"
    "transition:height 0.6s ease;"
    "height:100vh;"
    "overflow:auto;"
  "}"
  ".dropdown{"
    "position:relative;"
    "height:auto;"
    "min-height:58px;"
  "}"
  ".dropdown:hover>ul{"
    "position:relative;"
    "display:block;"
    "min-width:100%;"
  "}"
  ".dropdown>a::after{"
    "position:absolute;"
    "content:'';"
    "right:10px;"
    "top:25px;"
    "border-width:5px 5px 0;"
    "border-color:transparent;"
    "border-style:solid;"
  "}"
  ".dropdown>ul{"
    "display:block;"
    "overflow-x:hidden;"
    "list-style:none;"
    "padding:0;"
  "}"
  ".dropdown>ul .luxbar-item{"
    "min-width:100%;"
    "height:29px;"
    "padding:5px 10px 5px 40px;"
  "}"
  ".dropdown>ul .luxbar-item a{"
    "min-height:29px;"
    "line-height:29px;"
    "padding:0;"
  "}"
  "@media screen and (min-width:768px){"
    ".luxbar-navigation{"
      "flex-flow:row;"
      "justify-content:flex-end;"
    "}"
    ".luxbar-hamburger{"
      "display:none;"
    "}"
    ".luxbar-checkbox:not(:checked)~.luxbar-menu{"
      "overflow:visible;"
    "}"
    ".luxbar-checkbox:checked~.luxbar-menu{"
      "height:58px;"
    "}"
    ".luxbar-menu .luxbar-item{"
      "border-top:0;"
    "}"
    ".luxbar-menu-right .luxbar-header{"
      "margin-right:auto;"
    "}"
    ".dropdown{"
      "height:58px;"
    "}"
    ".dropdown:hover>ul{"
      "position:absolute;"
      "left:0;"
      "top:58px;"
      "padding:0;"
    "}"
    ".dropdown>ul{"
      "display:none;"
    "}"
    ".dropdown>ul .luxbar-item{"
      "padding:5px 10px;"
    "}"
    ".dropdown>ul .luxbar-item a{"
      "white-space:nowrap;"
    "}"
  "}"
  ".luxbar-checkbox:checked+.luxbar-menu .luxbar-hamburger-doublespin span::before{"
    "transform:rotate(225deg);"
  "}"
  ".luxbar-checkbox:checked+.luxbar-menu .luxbar-hamburger-doublespin span::after{"
    "transform:rotate(-225deg);"
  "}"
  ".luxbar-menu-material-bluegrey,"
  ".luxbar-menu-material-bluegrey .dropdown ul{"
    "background-color:#263238;"
    "color:#fff;"
  "}"
  ".luxbar-menu-material-bluegrey .active,"
  ".luxbar-menu-material-bluegrey .luxbar-item:hover{"
    "background-color:#37474f;"
  "}"
  ".luxbar-menu-material-bluegrey .luxbar-hamburger span,"
  ".luxbar-menu-material-bluegrey .luxbar-hamburger span::before,"
  ".luxbar-menu-material-bluegrey .luxbar-hamburger span::after{"
    "background-color:#fff;"
  "}"
};

